Repository: shayan-ghzl/resume-portfolio
Catalog: projects/locale-internationalization/message-*.xlf
Languages: fa

source: ltr
fa: rtl

source: With three years of experience, I lived and breathed the web.
fa: با سه سال تجربه در وب زندگی کردم و نفس کشیدم.

source: View portfolio
fa: مشاهده نمونه کارها

source: portfolio image
fa: تصویر نمونه کار

source: Forpet
fa: فورپت

source: Raap Yadak
fa: راپ یدک

source: Timche Zargary
fa: تیمچه زرگری

source: Fanpet
fa: فن پت

source: Kharchang Accounting
fa: حسابداری خرچنگ

source: SUMMERY
fa: درباره من

source: About 3 years of experience in creating beautiful and responsive user interfaces for mobile/tablet/desktop using HTML, CSS, SCSS, JavaScript, jQuery, Bootstrap and building single page applications (SPA) and multi-platform websites with Using Responsive/RWD design and Angular framework.
fa: حدود 3 سال تجربه در ایجاد رابط های کاربری زیبا و واکنش گرا برای موبایل/تبلت/دسکتاپ با استفاده از HTML, CSS, SCSS, JavaScript, jQuery, Bootstrap و ساخت اپلیکیشن های تک صفحه ای (SPA) و وب سایت های چند پلتفرمی با استفاده از طراحی Responsive/RWD و Angular framework.

source: Experience working as a contributor in other Angular repositories also has a few pull requests in other repositories like Primeng.
fa: تجربه کار به عنوان یک مشارکت کننده در دیگر پروژه های Angular نیز دارای چند pull request در پروژه های دیگر مانند Primeng است.

source: Experience in working with RESTFUL Web Services.
fa: تجربه کار با RESTFUL APIS.

source: Deep understanding and skill in HTML, CSS, Bootstrap, JavaScript and TypeScript.
fa: درک عمیق و مهارت در HTML، CSS، Bootstrap، JavaScript و TypeScript.

source: Excellent interpersonal abilities, communication skills, time management and Team skills.
fa: توانایی های بین فردی عالی، مهارت های ارتباطی، مدیریت زمان و مهارت های تیمی.

source: CONTACT
fa: ارتباط

source: <i class="dashicons dashicons-location"></i>Isfahan, Iran
fa: <i class="dashicons dashicons-location"></i>اصفهان, ایران

source: Home
fa: خانه

source: Create a well-designed portfolio ^7000
fa: یک نمونه کار با طراحی خوب ایجاد کنید ^7000

source: Online business support and personalization ^10000
fa: پشتیبانی و شخصی سازی کسب و کار آنلاین ^10000

source: Shayan Ghazali
fa: شایان غزالی

source: Front-end Developer
fa: توسعه دهنده Front-end

source: SKILLS
fa: مهارت ها

source: EDUCATION
fa: تحصیلات

source: Associate in Hardware engineering<span class="academy">Najafabad azad university</span>
fa: کاردانی در رشته کامپیوتر گرایش سخت افزار <span class="academy">دانشگاه آزاد نجف آباد</span>

source: Sep 2012 - May 2016
fa: مهر 1391 - خرداد 1395

source: LANGUAGE
fa: زبان

source: EXPERIENCE
fa: تجربیات

source: HTML Template
fa: قالب وبسایت

source: Project Sample Url :<a target="_blank" href="https://github.com/shayan-ghzl/timche">https://github.com/shayan-ghzl/timche</a>
fa: لینک نمونه: <a target="_blank" href="https://github.com/shayan-ghzl/timche">https://github.com/shayan-ghzl/timche</a>

source: September 2020
fa: مهر 1399

source: Isfahan, Iran
fa: اصفهان, ایران

source: This is an HTML template for a jewelry online shop.
fa: یک قالب وب سایت است برای فروشگاه آنلاین طلا و جواهر.

source: this is a full responsive website template.
fa: این یک قالب وب سایت کاملا واکنش گرا است.

source: it is using swiper.js as a library for touch sliders.
fa: از swiper.js به عنوان کتابخانه ای برای اسلایدر های لمسی استفاده می کند.

source: it is also using gulp automation to compile scss.
fa: همچنین از gulp automation برای کامپایل کردن scss استفاده میکند.

source: position :
fa: سمت :

source: Front-end developer, HTML template builder in raapco organization
fa: توسعه دهنده Front-end، سازنده قالب وبسایت در سازمان raapco.

source: technology :
fa: تکنولوژی :

source: Wordpress template
fa: قالب وردپرس

source: Project Sample Url :<a target="_blank" href="http://safaeinuts.com/fanpet/">http://safaeinuts.com/fanpet/</a>
fa: لینک نمونه: <a target="_blank" href="http://safaeinuts.com/fanpet/">http://safaeinuts.com/fanpet/</a>

source: January 2021
fa: دی 1399

source: This is a WordPress website for a pet supply online shop.
fa: یک سایت وردپرس برای فروشگاه آنلاین لوازم حیوانات خانگی است.

source: it is using typescript.
fa: از typescript استفاده میکند.

source: it is also using gulp automation to compile scss and typescript.
fa: همچنین از gulp automation برای کامپایل کردن scss و typescript استفاده می کند.

source: Wordpress template developer, UI/UX designer in raapco organization
fa: توسعه دهنده قالب وردپرس, طراح UI/UX در سازمان raapco.

source: Safaei Nuts
fa: آجیل صفایی

source: Wordpress Project
fa: پروژه وردپرس

source: Project Url :<a target="_blank" href="http://safaeinuts.com">http://safaeinuts.com</a>
fa: لینک پروژه: <a target="_blank" href="http://safaeinuts.com">http://safaeinuts.com</a>

source: March 2021
fa: اسفند 1399

source: This is a WordPress website for a grocery online shop.
fa: یک وبسایت وردپرسی برای فروشگاه آنلاین آجیل صفایی است.

source: The images in the blog and product images of this website were created by me as a graphic designer.
fa: تصاویر وبلاگ و تصاویر محصولات این وب سایت توسط من به عنوان یک طراح گرافیک ایجاد شده است.

source: Wordpress Front-end developer in raapco organization
fa: توسعه دهنده وردپرس در سازمان raapco.

source: Angular Project
fa: پروژه انگولار

source: Project Sample Url :<a routerLink="/resume">Not available</a>
fa: لینک نمونه: <a routerLink="/resume">Not available</a>

source: April 2021 - May 2023<span>(2 years and a month)</span>
fa: فروردین 1400 - اردیبهشت 1402 <span>(2 سال و یک ماه)</span>

source: Kharchang is an online accounting and business management system powered by Angular framework and primeng components.
fa: خرچنگ یک سیستم حسابداری و مدیریت کسب و کار آنلاین است که از چهارچوب انگولار و کامپوننت های primeng بهره میگیرد.

source: We worked on this project for over two years, and sometimes I had to make changes in the primeng components.
fa: ما بیش از دو سال روی این پروژه کار کردیم, همچنین در خیلی از موارد نیاز به تغییر کامپوننت های primeng داشتیم که بنده این مسئولیت را به عهده داشتم.

source: I also have a few pull requests to primeng repository on the github and during this project I went through various challenges in Angular.
fa: همچنین تعدادی pull request روی پروژه primeng در گیت هاب انجام داده ام و در طول این پروژه چالش های مختلفی را در انگولار پشت سر گذاشتم.

source: it is using NGRX effects and store as a state manager.
fa: از کتابخانه NGRX به عنوان state manager در انگولار استفاده می کند.

source: authenticate users using sms otp code.
fa: اهراز هویت کاربر با استفاده از کد پیامکی.

source: Angular Developer in raapco organization
fa: توسعه دهنده انگولار در سازمان raapco.

source: 3 soot yadak
fa: 3 صوت یدک

source: Ionic Project
fa: پروژه Ionic

source: Project Sample Url :<a target="_blank" href="https://github.com/shayan-ghzl/yadak-angular-ionic">https://github.com/shayan-ghzl/yadak-angular-ionic</a>
fa: لینک نمونه: <a target="_blank" href="https://github.com/shayan-ghzl/yadak-angular-ionic">https://github.com/shayan-ghzl/yadak-angular-ionic</a>

source: July 2021
fa: تیر 1400

source: This is an Ionic application and also a startup in the field of automotive services and information.
fa: این یک پروژه Ionic و همچنین یک استارتاپ در حوزه خدمات و اطلاعات خودرو می باشد.

source: it is using Ionic framework for creating Hybrid applications.
fa: از چهارچوب Ionic برای تولید اپلیکیشن های هیبرید استفاده میکند.

source: Telegram Airdrop Bot
fa: ربات تلگرام ایردراپ

source: Simple Telegram bot
fa: ربات ساده تلگرام

source: November 2021
fa: آبان 1400

source: this is a simple Javascript Telegram bot for an agency to airdrop tokens.
fa: یک ربات ساده که از جاوا اسکریپت و Nodejs جهت توزیع توکن های یک آژانس استفاده میکند.

source: it is all about question and answer in Telegram bot.
fa: یک ربات ساده پرسش و پاسخ تگرامی است.

source: it is using Nodejs and Telegraf library.
fa: از Nodejs و کتابخانه Telegraf استفاده میکند.

source: As a javascript freelancer
fa: به عنوان یک فریلنسر جاوا اسکریپت

source: Letter Manager
fa: مدیریت بایگانی

source: February 2022
fa: بهمن 1400

source: this is an Angular project for an agency to manage their letters.
fa: یک پروژه انگولار برای یک آژانس جهت مدیریت بایگانی ها می باشد.

source: it is using Angular Forms and Angular Material.
fa: از فرم های انگولار و کتابخانه Angular Material بهره میگیرد.

source: As an Angular project freelancer
fa: به عنوان یک فریلنسر پروژه Angular

source: Project Sample Url :<a target="_blank" href="https://shayan-ghzl.github.io/raap-angular/">https://shayan-ghzl.github.io/raap-angular/</a>
fa: لینک نمونه: <a target="_blank" href="https://shayan-ghzl.github.io/raap-angular/">https://shayan-ghzl.github.io/raap-angular/</a>

source: August 2022
fa: مرداد 1401

source: This is an Angular pwa project as an auto parts online shop.
fa: یک وب اپلیکیشن انگولار برای فروشگاه آنلاین لوازم خودرو می باشد.

source: cache get requests to IndexedDB.
fa: درخواست ها را درون IndexedDB ذخیره و cache می نماید.

source: it is using Angular Cdk and Angular Material.
fa: از کتابخانه Angular Material و Cdk بهره میگیرد.

source: Fast Date Typing Package
fa: پکیج تایپ سریع تاریخ

source: Angular Library Project
fa: پروژه Angular Library

source: Project Url:<a target="_blank" href="https://www.npmjs.com/package/fast-date-typing">https://www.npmjs.com/package/fast-date-typing</a>
fa: لینک پروژه: <a target="_blank" href="https://www.npmjs.com/package/fast-date-typing">https://www.npmjs.com/package/fast-date-typing</a>

source: November 2022
fa: آبان 1401

source: This is a Npm package which made by Angular library.
fa: لیک پکیج Npm می باشد که به واسطه Angular Library ایجاد شده است.

source: For those businesses (accounting and numerical calculations) who want to enter the date through a fast keyboard.
fa: برای آن دسته از مشاغل (حسابداری و محاسبات عددی) که می خواهند تاریخ را از طریق صفحه کلید سریع وارد کنند.

source: This library is actually written for use in the kharchang accounting project.
fa: این کتابخانه در واقع برای استفاده در پروژه حسابداری خرچنگ نوشته شده است.

source: well documented Npm package.
fa: مستندات آن به خوبی و کامل نوشته شده است.

source: Project Sample Url :<a target="_blank" href="https://shayan-ghzl.github.io/forpet-angular/">https://shayan-ghzl.github.io/forpet-angular/</a>
fa: لینک نمونه: <a target="_blank" href="https://shayan-ghzl.github.io/forpet-angular/">https://shayan-ghzl.github.io/forpet-angular/</a>

source: April 2023
fa: فروردین 1402

source: This is an Angular pwa project as an pet supply online shop.
fa: یک پروژه وب اپلیکیشن انگولار برای فروشگاه آنلاین لوازم حیوانات خانگی است.

source: it is using rxjs subjects as a state manager.
fa: از کتابخانه rxjs subjects به عنوان state manager در انگولار استفاده میکند.

source: it is using Angular Material.
fa: از کتابخانه Angular Material استفاده میکند.

source: it is also has a fake api.
fa: همچنین یک fake api نیز دارد.

source: Ng Wordpress Menu Package
fa: پکیج منو در انگولار

source: Project Url:<a target="_blank" href="https://www.npmjs.com/package/ng-wordpress-menu">https://www.npmjs.com/package/ng-wordpress-menu</a>
fa: لینک پروژه: <a target="_blank" href="https://www.npmjs.com/package/ng-wordpress-menu">https://www.npmjs.com/package/ng-wordpress-menu</a>

source: May 2023
fa: اردیبهشت 1402

source: it supports different color themes.
fa: از چند تم مختلف رنگی پشتیبانی میکند.

source: it is scalable side menu.
fa: یک منو با قابلیت مقیاس پذیری می باشد.

source: ./assets/pdf/shayan-ghazali-resume-en.pdf
fa: ./assets/pdf/shayan-ghazali-resume-fa.pdf

source: Download Resume
fa: دانلود رزومه

source: Resume
fa: رزومه

source: All the rights of the pages for Mr. Programmer's website are reserved.
fa: تمام حقوق صفحات برای وب سایت آقای برنامه نویس محفوظ می باشد.

source: ./assets/images/logo-en.png
fa: ./assets/images/logo-fa.png

source: website logo
fa: لوگوی وبسایت

source: My Resume
fa: رزومه من

source: Contact Me
fa: تماس با من

source: https://shayan-ghzl.github.io/resume-portfolio/
fa: https://shayan-ghzl.github.io/

source: Persian Language
fa: زبان انگلیسی
